app/controllers/book_collection_controller.rb

SELECT "books".* FROM "books"
---
  def home
    flash[:alert] = params[:message]
    @books = Book.all

UPDATE "books" SET "author" = ?, "published_date" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["author", "C.S. Lewis"], ["published_date", "published"], ["updated_at", "2020-09-13 02:58:28.239666"], ["id", 1]]
INSERT INTO "books" ("title", "author", "genre", "price", "published_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
      if published_date != nil
        book.published_date = published_date
      end
      book.save

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
---
  def update
    @genres = ["Fiction", "Non-Fiction", "Science Fiction", "Mystery", "Historical Fiction",
      "Fantasy", "Horror Fiction", "Biography", "Thriller", "Poetry"]
    @genres = @genres.sort

    @years = []
    (1900..2020).each do |y|
      @years << y.to_s
    end

    @months = ["January", "February", "March", "April", "May", "June", "July", "August", "September",
        "October", "November", "December"]

    @days = []
    (1..31).each do |d|
      @days << d.to_s
    end
    @id = params[:id]
    @title = params[:title]
    @author = params[:author]
    @genre = params[:genre]
    @price = params[:price]
    @published_year = params[:published_year]
    @published_month = params[:published_month]
    @published_day = params[:published_day]
    if @title != nil
      book = Book.find_by_id(@id)

UPDATE "books" SET "published_date" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["published_date", "February 9, 1903"], ["updated_at", "2020-09-14 00:17:24.963446"], ["id", 19]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
---
        book.price = @price.to_i
      end
      book.published_date = "#{@published_month} #{@published_day} #{@published_year}"
      book.save
      redirect_to action: "home", message: "Updated Successfully"
    else
      book = Book.find_by_id(@id)

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
---
  def details
    book = Book.find_by_id(params[:id])

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 16]]
---
  def delete
    @id = params[:id]
    book = Book.find_by_id(@id)
    @title = book.title
    if params[:decision] == "yes"
      book.destroy